const data = {
    "cards": {
        "Власть над огнём": {
            "class": "Магия",
            "level": "1 уровень",
            "school": "преобразование",
            "makeTime": "1 действие",
            "distance": "60 футов",
            "components": "С",
            "concentration":"true",
            "longer": "Мгновенная или 1 час",
            "text": [
                "Вы выбираете немагическое пламя, которое вы можете видеть в пределах дистанции и которое помещается в куб с длиной ребра 5 футов. Вы можете управлять им одним из нижеперечисленных способов:",
                "Вы можете мгновенно распространить огонь на 5 футов в одном направлении, если там присутствует дерево или другое топливо.",
                "Вы можете мгновенно потушить огонь в кубе.",
                "Вы можете увеличить или уменьшить вдвое область яркого и тусклого света, излучаемого пламенем, а также поменять его цвет. Эффект действует 1 час.",
                "Вы можете сотворить в огне изображение, которое будет отдалённо напоминать существо, предмет или место, и двигаться согласно вашим указаниям. Эффект действует 1 час.",
                "Вы можете увеличить или уменьшить вдвое область яркого и тусклого света, излучаемого пламенем, а также поменять его цвет. Эффект действует 1 час.",
                "Вы можете сотворить в огне изображение, которое будет отдалённо напоминать существо, предмет или место, и двигаться согласно вашим указаниям. Эффект действует 1 час.",
                "Вы можете увеличить или уменьшить вдвое область яркого и тусклого света, излучаемого пламенем, а также поменять его цвет. Эффект действует 1 час.",
                "Если вы накладываете это заклинание несколько раз, одновременно вы не можете поддерживать более 3 длительных эффектов одновременно. Вы можете действием отменить один из действующих эффектов.",
            ],
            "hightlevel": [
                "выс леелееяывфывфыв"
            ]
        },
        "Волшебный камень": {
            "class": "Магия",
            "level": "2 уровень",
            "school": "преобразование",
            "makeTime": "1 бонусное действие",
            "distance": "Касание",
            "components": "В, С",
            "longer": "1 минута",
            "text": [
                "Вы касаетесь от 1 до 3 камней и наделяете их магической силой. Вы или кто-либо ещё можете совершить дальнобойную атаку заклинанием, кинув один из этих камней или запустив его при помощи пращи. Дальность броска рукой составляет 60 футов. Если кто-либо другой атакует этим камнем, он использует для броска атаки ваш модификатор базовой характеристики вместо своего. При попадании цель получает 1к6 + ваш модификатор базовой характеристики дробящего урона. Вне зависимости от того, попал камень или нет, это заклинание перестаёт на него действовать.",
                "Если вы накладываете это заклинание ещё раз, его эффект преждевременно заканчивается на тех камнях, что были зачарованы прежде.",
            ],
            "hightlevel": []
        },
        "Дубинка": {
            "class": "Магия",
            "level": "3 уровень",
            "school": "преобразование",
            "makeTime": "1 бонусное действие",
            "distance": "Касание",
            "components": "В, С, M",
            "longer": "1 минута",
            "text": [
                "Дерево дубинки или боевого посоха, который вы держите, наполняется силой природы. Пока заклинание активно, вы можете использовать свою базовую характеристику вместо Силы для бросков рукопашной атаки и урона при использовании этого оружия, и кость урона становится равной к8. Если оружие не было магическим, оно становится им. Заклинание оканчивается, если вы наложите его ещё раз или выпустите оружие из рук.",
            ],
            "hightlevel": []
        },
        "Власть над огнём2": {
            "class": "Магия",
            "level": "4 уровень",
            "school": "преобразование",
            "makeTime": "1 действие",
            "distance": "60 футов",
            "components": "С",
            "longer": "Мгновенная или 1 час",
            "text": [
                "Вы выбираете немагическое пламя, которое вы можете видеть в пределах дистанции и которое помещается в куб с длиной ребра 5 футов. Вы можете управлять им одним из нижеперечисленных способов:",
                "Вы можете мгновенно распространить огонь на 5 футов в одном направлении, если там присутствует дерево или другое топливо.",
                "Вы можете мгновенно потушить огонь в кубе.",
                "Вы можете увеличить или уменьшить вдвое область яркого и тусклого света, излучаемого пламенем, а также поменять его цвет. Эффект действует 1 час.",
                "Вы можете сотворить в огне изображение, которое будет отдалённо напоминать существо, предмет или место, и двигаться согласно вашим указаниям. Эффект действует 1 час.",
                "Если вы накладываете это заклинание несколько раз, одновременно вы не можете поддерживать более 3 длительных эффектов одновременно. Вы можете действием отменить один из действующих эффектов.",
            ],
            "hightlevel": [ ]
        },
        "Волшебный камень2": {
            "class": "Магия",
            "level": "и",
            "school": "преобразование",
            "makeTime": "1 бонусное действие",
            "distance": "Касание",
            "components": "В, С",
            "longer": "1 минута",
            "text": [
                "Вы касаетесь от 1 до 3 камней и наделяете их магической силой. Вы или кто-либо ещё можете совершить дальнобойную атаку заклинанием, кинув один из этих камней или запустив его при помощи пращи. Дальность броска рукой составляет 60 футов. Если кто-либо другой атакует этим камнем, он использует для броска атаки ваш модификатор базовой характеристики вместо своего. При попадании цель получает 1к6 + ваш модификатор базовой характеристики дробящего урона. Вне зависимости от того, попал камень или нет, это заклинание перестаёт на него действовать.",
                "Если вы накладываете это заклинание ещё раз, его эффект преждевременно заканчивается на тех камнях, что были зачарованы прежде.",
            ],
            "hightlevel": []
        },
        "Дубинка2": {
            "class": "Магия",
            "level": "v",
            "school": "преобразование",
            "makeTime": "1 бонусное действие",
            "distance": "Касание",
            "components": "В, С, M",
            "longer": "1 минута",
            "text": [
                "Дерево дубинки или боевого посоха, который вы держите, наполняется силой природы. Пока заклинание активно, вы можете использовать свою базовую характеристику вместо Силы для бросков рукопашной атаки и урона при использовании этого оружия, и кость урона становится равной к8. Если оружие не было магическим, оно становится им. Заклинание оканчивается, если вы наложите его ещё раз или выпустите оружие из рук.",
            ],
            "hightlevel": []
        },
    },
    "classes": {
        'Бард': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Коллегия духов": [
                'Указание',
            ],
        },
        'Варвар': {
            "Базовые заклинания": [],
        },
        'Воин': {
            "Базовые заклинания": [],
        },
        'Волшебник': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Магия хронургии": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Магия гравитургии": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Друид': {
            "Базовые заклинания": [
                'Власть над огнём',
                'Волшебный камень',
                'Дубинка',
                'Власть над огнём2',
                'Волшебный камень2',
                'Дубинка2',
                'bard4',
            ],
            "Круг дикого огня": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(болото)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(гора)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(лес)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(луг)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(побережье)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(подземье)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(пустыня)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг земли(тундра)": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг звёзд": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Круг спор": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Жрец': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Домен бури": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен войны": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен жизни": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен знаний": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен обмана": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен природы": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен света": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен смерти": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен магии": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен кузни": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен упокоения": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен мира": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен порядка": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Домен сумерек": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Изобретатель': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Алхимик": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Артеллерист": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Боевой кузнец": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Бронник": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Колдун': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Архифея": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Исчадие": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Великий Древний": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Бессмертный": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Ведьмовский клинок": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Небожитель": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Бездонный": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Гений": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Нежить": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Монах': {
            "Базовые заклинания": [],
            "Путь тени": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Путь четырех стихий": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Путь солнечной души": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Паладин': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Клятва преданности": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва древних": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва мести": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятвопреступник": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва короны": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва искупления": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва покорения": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва славы": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Клятва смотрителей": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Плут': {
            "Базовые заклинания": [],
            "Мистический ловкач": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Следопыт': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Странник горизонта": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Сумрачный охотник": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Убийца монстров": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Странник фей": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Хранитель роя": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Наездник на дрейке": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
        'Чародей': {
            "Базовые заклинания": [
                'bard1',
                'bard2',
                'bard3',
                'bard4',
            ],
            "Божественная душа": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Теневая магия": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Аберрантный разум": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
            "Заводная душа": [
                'Жизнь1',
                'Жизнь2',
                'Жизнь3',
            ],
        },
    }
}